Tekla Open API Reference for Tekla Structures 2025
TextElement.Value Property
 The textual value of the text element.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string Value { get; set; }
Public Property Value As String
	Get
	Set
Property Value
Type: String
See Also
Reference
TextElement Class
Tekla.Structures.Drawing Namespace